FemDesign.Reinforcement.LongitudinalBar.#ctor
Parameterless constructor for serialization

FemDesign.Reinforcement.LongitudinalBar.#ctor(FemDesign.Geometry.Point2d,System.Double,System.Double,System.Double,System.Double,System.Boolean)
Construct longitudinal bar using start and end distance from bar start
startAnchorage: Start anchorage in meters.
endAnchorage: End anchorage in meters.

FemDesign.Reinforcement.LongitudinalBar.#ctor(FemDesign.Bars.Bar,FemDesign.Geometry.Point2d,System.Double,System.Double,System.Double,System.Double,System.Boolean)
Construct longitudinal bar using start and end param from bar start
startAnchorage: Start anchorage in meters.
endAnchorage: End anchorage in meters.